const msgWelcome = 'Привет! Я помощник интернет-магазина «Омолоко» и твой проводник в мир мороженого! Ты готов выполнить несколько простых заданий и получить приз?';
const msgStepNo = 'Очень жаль, возвращайся, если захочешь получить подарок! Для того, чтобы продолжить с того момента, на котором остановился, напиши "Продолжить".';
const msgStepStop = 'Очень жаль, возвращайся, если захочешь получить подарок! Для того, чтобы продолжить с того момента, на котором остановился, напиши "Продолжить".';
const msgStepContinue = 'Вижу, у вас есть незаконченная игра, напишите "Продолжить", чтобы продолжить игру.';

const msgNoSubscribeToGroup = 'Так не пойдет, пожалуйста, подпишись на нашу группу.';
const msgNoLikes = 'Так не пойдет, пожалуйста, вернись в группу и поставь лайки.';

const msgStepOne = 'Начинаем охоту за подарками! Для начала самое простое задание для разминки — подпишись на нашу группу, поставь свой «лайк» на пять последних записей и возвращайся за следующим заданием!';
const msgStepTwo = 'Вижу, что ты уже справился с первым заданием! Теперь ответь на вопрос — какое из нашего мороженого самое сказочное?';
const msgStepThree = 'И снова задание — а ты знал, что мы есть в телеграме? Следить за нашими новостями можно на любой удобной платформе, скорее подписывайся, чтобы не пропустить! https://t.me/omolokomsk';
const msgStepFour = 'Для тебя новая загадка, но здесь придется подумать и побывать на нашем сайте — попробуй угадать наше мороженое из лотков по эмодзи -  🍋 🍯 💊 🍦';

const msgStepTwoSuccefull = 'Правильно! Наш Единорожка https://omoloko.ru/catalog/icecream/eskimo/eskimo-edinorozhka-65g — это ванильный радужный пломбир в форме единорога, настоящая сказка для любителей мороженого!';
const msgStepThreeSuccefull = 'Спасибо, что остаешься с нами! Кстати, мы постоянно сообщаем о новых промокодах и акциях в социальных сетях, чтобы сделать твой заказ более выгодным и приятным!';
const msgStepFourSuccefull = 'Ты молодец, настоящий знаток мороженого! Медовое с лимоном и имбирем — больше похоже на сладкое лекарство от хандры, за это оно так полюбилось нашим клиентам! Попробуй! Следующее задание самое важное, ведь тебе предстоит совершить заказ! Скорее переходи на наш сайт https://omoloko.ru/, а мы дарим тебе сертификат номиналом 500 рублей для выгодных покупок. Отправим тебе его совсем скоро. Спасибо за участие, оцени насколько было интересно участвовать?'


module.exports = {
    msgWelcome,
    msgStepOne,
    msgStepTwo,
    msgNoSubscribeToGroup,
    msgNoLikes,
    msgStepTwoSuccefull,
    msgStepThree,
    msgStepThreeSuccefull,
    msgStepFour,
    msgStepFourSuccefull,
    msgStepNo,
    msgStepStop,
    msgStepContinue
}